import 'package:flutter/material.dart';

class Cha_Page extends StatefulWidget {
  const Cha_Page({Key? key}) : super(key: key);

  @override
  _Cha_PageState createState() => _Cha_PageState();
}

class _Cha_PageState extends State<Cha_Page> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        iconTheme: IconThemeData(color: Colors.blue),
        backgroundColor: Colors.white,
        title: Text('টং এর চা',style: TextStyle(
          color: Colors.black,
        ),),
        centerTitle: true,
      ),

      body: ListView(
        children: [
          Card(
            child: Column(
              children: [
                Container(
                  margin: EdgeInsets.all(12.0),
                  height: 200,
                  width: 480,
                  decoration: BoxDecoration(
                      border: Border.all(
                        color: Color(0xff00A2E8),
                        width: 2,
                      ),
                      borderRadius: BorderRadius.circular(20),
                      image: DecorationImage(
                        fit: BoxFit.fill,
                        image: AssetImage('assets_street/cha_1.jpg'),
                      )
                  ),
                ),

                Container(
                    alignment: Alignment.centerLeft,
                    margin: EdgeInsets.all(12.0),
                    child: RichText(
                      softWrap: true,
                      text: TextSpan(
                          text: 'টং এর চা',
                          style: TextStyle(
                            fontSize: 20.0,
                            fontWeight: FontWeight.bold,
                            color: Colors.black,
                          ),
                          children: [

                          ]
                      ),
                    )
                ),

                Container(
                  margin: EdgeInsets.all(12.0),
                  child: RichText(
                      softWrap: true,
                      text: TextSpan(
                          text: 'বর্ণনা\n \n',
                          style: TextStyle(
                              color: Colors.black
                          ),
                          // style: DefaultTextStyle.of(context).style,
                          children: [
                            // TextSpan(
                            //     text: 'If ',
                            //     style: TextStyle(
                            //       color: Colors.blue,
                            //       fontSize: 18.0,
                            //     )
                            // ),
                            TextSpan(
                              text: 'এই শহরে টং এর চায়ের মানে কি? নিশ্চয়ই কাপ ভর্তি  ভালোবাসা।  জীবন হলো এক কাপ চায়ের মতোই। এটা তেমন স্বাদ দিবে, যেমন আপনি বানাবেন।টং ঘরের নাম শুনলেই মনে হয় রাস্তার পাশে ছোট টংয়ের দোকান। দিনভর আড্ডা। তরুণদের কাছে চায়ের দোকান মানেই প্রিয় আড্ডার জায়গা। ক্লাস থেকে বেরিয়ে একটু রিফ্রেশ হওয়া চাই। যাওয়া চাই রাস্তার পাশের ছোট্ট টং দোকানে। সেখানে সদলবলে চা খাওয়ার সাথে যে জমিয়ে আড্ডা হবে—সে কথা বলাই বাহুল্য। দোকানের চা বিক্রেতা এ আড্ডাবাজদের মামা বলা যায়, গণ মামা হয়ে ওঠেন। আড্ডায় তারও একটা উষ্ণ অংশগ্রহণ থাকে। শীতে যখন পুরো শহর জবুথবু তখন এই টং দোকানের ছোট টুল বা ভাঙা বেঞ্চগুলো নড়েচড়ে বসে কথার গরমে। চা সাধারণত দু’রকম রঙের দেখতে হয়। দুধ না-মেশানো লাল চা অথবা দুধ মেশানো চালু চা। টং দোকান গুলোতেই মেলে অল্পদামি খাবার ও অফুরন্ত বসার সুযোগ। বসার আয়োজন বলতে ছোট্ট টুল বা কিছু ভাঙা বেঞ্চ। কিন্তু তাতে কি! আড্ডার সময় এগুলোকেই রাজকীয় আসন মনে হয়। হয়তো তাই আড্ডায় বসে রাজা-উজির মারার গল্পে কেউ কম যায় না। গল্পের পাশাপাশি সম্পর্কের পরিধিও উদার হয়ে ওঠে। তাইতো চা বিক্রেতা লোকটিও এ আড্ডাবাজদের মামা হয়ে ওঠে। এই মামা কেও দেখা যায় আড্ডাবাজ ভাগ্নে-ভাগ্নিদের বিশেষ খাতির যত্ন করতে। এমনকি ছোট ছোট গ্রুপগুলোর মধ্যেও কখনো কখনো আন্তরিক সম্পর্ক গড়ে ওঠে। অমুক বড় ভাই কিংবা তমুক ছোট ভাইয়ের প্রতি শ্রদ্ধা বা স্নেহের ঘাটতি থাকে না। কখনো কখনো একে অপরের ব্যক্তিগত সমস্যাও সাহায্যের হাত বাড়িয়ে দেয়। আর এটাই হলো রাস্তার পাশের ছোট্ট টং দোকানের বিশাল উদারতা। এক হাতে ল্যাপটপ, আরেক হাতে চা। কখন যে চা শেষ হয়ে গেছে তার হিসেব নেই। চলছে আড্ডা। পাশে গিটারে উঠছে চিরচেনা সুর। কেউ কেউ গাইছে বেসুরে। আবার কেউবা ব্যস্ত খুনসুটিতে। আর এসব আড্ডার বিষয় কোনো নির্দিষ্টতা নেই। ব্যক্তিগত নানা বিষয়ের পাশাপাশি রাজনৈতিক, অর্থনৈতিক, সাহিত্য, সংস্কৃতিসহ গঠনমূলক আলোচনাও হয়। অনেক সময় হাস্যরসের আড্ডাও হয়। আর টং দোকানের মেন্যুর সব খাবার আক্ষরিক অর্থেই হাতের নাগালে। ইচ্ছে হলেই হাত বাড়িয়ে তুলে নেওয়া যায় বিস্কুট থেকে শুরু করে বাটারবন, কেক, কলা প্রভৃতি। তবে টংয়ের মূল আকর্ষণ চা। যে দোকানের চা ভালো হয় সে দোকানেই আড্ডাবাজদের ভিড় লেগে থাকে। আড্ডার ফাঁকে চলে চায়ের কাপে চুমুক। শুধু সমবয়সী না, দোকানে আসা বয়সে বড়দের সঙ্গেও আড্ডা জমে ওঠে। এই ছোট ছোট চুমুক দিয়েই সামাজিক, রাজনৈতিক মূল্যবোধ সম্পর্কে নতুন ধারণা নেওয়া থেকে শুরু করে ব্যক্তিগত জীবনের অনেক কিছুই উঠে আসে আড্ডায়। পক্ষে-বিপক্ষে চলে আলোচনা। আড্ডা মানে অফুরন্ত আনন্দ। টং দোকানের এই আড্ডা এই তারুণ্যের কাছে দৈনন্দিন জীবনের একটি উল্লেখ্যযোগ্য অংশই বলা চলে। সারাদিন ক্লাসের পর টং দোকানে এক কাপ চা যেন তৃষ্ণার্ত পথিকের কাছে শীতল পানির মতো। বন্ধুদের সাথে আড্ডায় বসে এক কাপ চা হলেই সব ক্লান্তির অবসান ঘটে। ক্লাসের ফাঁকে চায়ের আড্ডাই যেন উদ্দীপনা ফিরিয়ে নিয়ে আসে। অনেকের আবার চা খাওয়া শুরু ক্যাম্পাস থেকেই। তরুণরা বরাবরাই আড্ডাবাজিতে পারদর্শী হয়ে থাকে। সারাদিন এলাকার বাইরের বন্ধুদের সাথে আড্ডা। সন্ধ্যারাতে ফিরে এলাকার ভাই ও বন্ধুদের সাথের আড্ডা। রাতে বাসায় ফিরে ফেসবুকে আড্ডা। যারা আজ তরুণ সময়টি পেরিয়ে এসেছেন তাদের প্রায় অনেকেরই অভিজ্ঞতায় কলেজ ও ভার্সিটি জীবনে শুধু আড্ডার জন্য ক্লাস পালিয়ে কোনো টং দোকানে আড্ডা মারার অভিজ্ঞতা তো থাকবেই। টং দোকানে বিশেষজ্ঞের মতো চায়ের কাপে ঝড় তুলতে কেউ যেন কারো চেয়ে কম যায় না। তবে বেলা শেষে এই টং দোকানের আড্ডায় চায়ের পেছনে মাসে বেশ ভালো একটা অংকের টাকাই খরচ হয়। কেননা এখানে একা চা খাওয়া মানেই হচ্ছে চা খাওয়ার নামে গরম মিষ্টি পানি খাওয়া। এখানে কেউ না কেউ জুটে যায়, গল্পের ছলে সেই সাথে বাড়ে আড্ডার বিষয় বাড়ে চায়ের বিল। টং দোকানের এই আড্ডার সময়টাতে অনিয়মই যেন জীবনের নিয়ম!',
                              style: TextStyle(
                                color: Colors.grey,
                              ),
                            )
                          ]
                      )
                  ),
                )
              ],
            ),
          ),
        ],
      ),
    );
  }
}
